Data Mapping

In [1]:
import pandas as pd
import numpy as np

In [2]:
df2 = pd.DataFrame({'food':['bacon','pulled pork', 'bacon','Pastrami','corned beef', 'Bacon','pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})
df2 #아래 데이터는 소문자와 대문자가 섞여있다.

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [3]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [4]:
df2["animal"] = df2["food"].map(str.lower).map(meat_to_animal)
df2

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [5]:
df2["animal"]=df2["food"].apply(lambda x:meat_to_animal[x.lower()])
df2

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

category

In [6]:
df3 = pd.DataFrame({"id":[1,2,3,4,5,6],"raw_grade":['a','b','b','a','a','e']})
df3

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [7]:
df3["grade"]=df3["raw_grade"].astype("category")
df3["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [8]:
df3["grade"].cat.categories

Index(['a', 'b', 'e'], dtype='object')

In [9]:
df3["grade"].cat.categories=["very good","good","very bad"]
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [10]:
df3["grade"] = df3["grade"].cat.set_categories(["very good","bad","medium","good","very bad"])
df3["grade"].cat.categories

Index(['very good', 'bad', 'medium', 'good', 'very bad'], dtype='object')

In [11]:
df3.sort_values(by="grade") #이 정렬은 문자순서가 아닌 카테고리로 정해준 순서대로 정렬해준다.

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

범위 Categorizing

In [12]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32] #나이를 가진 튜플들이라고 생각하자. 
bins = [18,25,35,60,100] #이것은 구간이다. 이는 pandas 에서 제공하는 .cut() 을 이용하기 위함이다.

In [13]:
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [14]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [15]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [16]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

Category Naming

In [17]:
group_names=["Youth","YoungAdult","MiddleAged","Senior"]

In [18]:
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [MiddleAged < Senior < YoungAdult < Youth]

In [19]:
data = np.random.rand(20)
pd.cut(data,4,precision=2) #소수점2째자리까지 4개의 카테고리로

[(0.28, 0.49], (0.49, 0.7], (0.073, 0.28], (0.28, 0.49], (0.7, 0.91], ..., (0.7, 0.91], (0.7, 0.91], (0.28, 0.49], (0.7, 0.91], (0.49, 0.7]]
Length: 20
Categories (4, interval[float64]): [(0.073, 0.28] < (0.28, 0.49] < (0.49, 0.7] < (0.7, 0.91]]

In [20]:
data4 = np.random.randn(1000)

In [21]:
cats = pd.qcut(data4,4) #정규분포를 이용하여 그룹을 나누기(Q. 어떤 기준으로 4등분하는지?)

In [22]:
cats

[(-0.017, 0.705], (-0.663, -0.017], (-0.017, 0.705], (0.705, 3.098], (0.705, 3.098], ..., (-3.165, -0.663], (0.705, 3.098], (-0.017, 0.705], (-0.017, 0.705], (-3.165, -0.663]]
Length: 1000
Categories (4, interval[float64]): [(-3.165, -0.663] < (-0.663, -0.017] < (-0.017, 0.705] < (0.705, 3.098]]

In [23]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),'data2':np.random.rand(5)})
df

      data1     data2 key1 key2
0  0.870874  0.853241    a  one
1 -0.427673  0.539992    a  two
2  0.833220  0.739585    b  one
3 -0.327402  0.717909    b  two
4 -0.428646  0.740780    a  one

Grouping & Statistics

In [24]:
grouped = df["data1"].groupby(df["key1"])
grouped

In [25]:
grouped.mean()

key1
a    0.004852
b    0.252909
Name: data1, dtype: float64

Double Grouping

In [26]:
means = df["data1"].groupby([df["key1"],df["key2"]]).mean()

In [27]:
means

key1  key2
a     one     0.221114
      two    -0.427673
b     one     0.833220
      two    -0.327402
Name: data1, dtype: float64

In [28]:
means.unstack()

key2       one       two
key1
a     0.221114 -0.427673
b     0.833220 -0.327402

In [29]:
df.groupby("key1").mean()

         data1     data2
key1
a     0.004852  0.711337
b     0.252909  0.728747

In [30]:
df.groupby("key1").count()

      data1  data2  key2
key1
a         3      3     3
b         2      2     2

In [31]:
df.groupby(["key1","key2"])["data2"].mean()

key1  key2
a     one     0.797010
      two     0.539992
b     one     0.739585
      two     0.717909
Name: data2, dtype: float64

그룹 순회

In [32]:
for name,group in df.groupby("key1"):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.870874  0.853241    a  one
1 -0.427673  0.539992    a  two
4 -0.428646  0.740780    a  one
b
      data1     data2 key1 key2
2  0.833220  0.739585    b  one
3 -0.327402  0.717909    b  two

In [33]:
for (k1,k2), group in df.groupby(["key1","key2"]):
    print(k1,k2)
    print(group)

a one
      data1     data2 key1 key2
0  0.870874  0.853241    a  one
4 -0.428646  0.740780    a  one
a two
      data1     data2 key1 key2
1 -0.427673  0.539992    a  two
b one
     data1     data2 key1 key2
2  0.83322  0.739585    b  one
b two
      data1     data2 key1 key2
3 -0.327402  0.717909    b  two

In [34]:
pieces=dict(list(df.groupby("key1")))
pieces['b']

      data1     data2 key1 key2
2  0.833220  0.739585    b  one
3 -0.327402  0.717909    b  two

In [38]:
pieces['a']

      data1     data2 key1 key2
0  0.870874  0.853241    a  one
1 -0.427673  0.539992    a  two
4 -0.428646  0.740780    a  one

In [49]:
df5 = pd.DataFrame(np.random.randn(5,5), 
                   columns =['a','b','c','d','e'],
                  index = ['joe','Steve','Wes','Jim','Travis'])
df5

               a         b         c         d         e
joe     1.209673 -1.007922 -0.768871  1.892375 -0.334357
Steve   2.349478 -0.060999 -1.587690 -1.109909 -0.115928
Wes     1.564760 -0.558288 -0.513708 -0.705767 -0.614652
Jim     0.468076  0.663263  0.339198  0.109820 -1.404763
Travis -0.494056  0.443346  1.156855 -0.255056  0.325121

In [51]:
map_dict = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [58]:
df5.groupby(map_dict,axis = 1).sum()

            blue       red
joe     1.123503 -0.132607
Steve  -2.697599  2.172551
Wes    -1.219475  0.391821
Jim     0.449019 -0.273424
Travis  0.901799  0.274410

In [60]:
map_s=pd.Series(map_dict)
map_s

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [64]:
df5.groupby(map_dict,axis=1).count()

        blue  red
joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [66]:
df

      data1     data2 key1 key2
0  0.870874  0.853241    a  one
1 -0.427673  0.539992    a  two
2  0.833220  0.739585    b  one
3 -0.327402  0.717909    b  two
4 -0.428646  0.740780    a  one

In [70]:
grouped = df.groupby("key1")
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [72]:
grouped.agg([peak_to_peak])

            data1        data2
     peak_to_peak peak_to_peak
key1
a        1.299520     0.313249
b        1.160622     0.021677

In [74]:
grouped.agg("std")

         data1     data2
key1
a     0.749998  0.158686
b     0.820683  0.015328

In [75]:
grouped.describe() #describe() 함수는 다양한 통계함수를 한꺼번에 나타낸다.

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.004852  0.749998 -0.428646 -0.428160 -0.427673  0.221600
b      2.0  0.252909  0.820683 -0.327402 -0.037247  0.252909  0.543064

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.870874   3.0  0.711337  0.158686  0.539992  0.640386  0.740780
b     0.833220   2.0  0.728747  0.015328  0.717909  0.723328  0.728747


           75%       max
key1
a     0.797010  0.853241
b     0.734166  0.739585